### Ordinal Number Encoding

In [54]:
import datetime

In [55]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2020, 7, 19, 22, 37, 54, 798026)

In [56]:
# timedelta gives diff in date
today_date-datetime.timedelta(3)

datetime.datetime(2020, 7, 16, 22, 37, 54, 798026)

In [57]:
# List comprehension
# generating the 15 list of date
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [58]:
import pandas as pd
data = pd.DataFrame(days,columns=['Day'])
data.head()

                         Day
0 2020-07-19 22:37:54.798026
1 2020-07-18 22:37:54.798026
2 2020-07-17 22:37:54.798026
3 2020-07-16 22:37:54.798026
4 2020-07-15 22:37:54.798026

In [59]:
data['Day'].dt.day_name()

0        Sunday
1      Saturday
2        Friday
3      Thursday
4     Wednesday
5       Tuesday
6        Monday
7        Sunday
8      Saturday
9        Friday
10     Thursday
11    Wednesday
12      Tuesday
13       Monday
14       Sunday
Name: Day, dtype: object

In [60]:
data['weekday'] = data['Day'].dt.day_name()
data.head()
#data['Day'].dt.year
#data['Day'].dt.month
#data['Day'].dt.hour

                         Day    weekday
0 2020-07-19 22:37:54.798026     Sunday
1 2020-07-18 22:37:54.798026   Saturday
2 2020-07-17 22:37:54.798026     Friday
3 2020-07-16 22:37:54.798026   Thursday
4 2020-07-15 22:37:54.798026  Wednesday

In [61]:
dictionary ={'Monday':1, 'Tuesday':2, 'Wednesday':3,'Thursday':4, 'Friday':5, 'Saturday':6,'Sunday':7}
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [62]:
# map the dict with the weekday
data['weekday_ordinal'] = data['weekday'].map(dictionary)
data

                          Day    weekday  weekday_ordinal
0  2020-07-19 22:37:54.798026     Sunday                7
1  2020-07-18 22:37:54.798026   Saturday                6
2  2020-07-17 22:37:54.798026     Friday                5
3  2020-07-16 22:37:54.798026   Thursday                4
4  2020-07-15 22:37:54.798026  Wednesday                3
5  2020-07-14 22:37:54.798026    Tuesday                2
6  2020-07-13 22:37:54.798026     Monday                1
7  2020-07-12 22:37:54.798026     Sunday                7
8  2020-07-11 22:37:54.798026   Saturday                6
9  2020-07-10 22:37:54.798026     Friday                5
10 2020-07-09 22:37:54.798026   Thursday                4
11 2020-07-08 22:37:54.798026  Wednesday                3
12 2020-07-07 22:37:54.798026    Tuesday                2
13 2020-07-06 22:37:54.798026     Monday                1
14 2020-07-05 22:37:54.798026     Sunday                7

### Count or Frequency Encoding

In [63]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header=None, index_col= None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [64]:
# taking categorical features
columns= [1,3,5,6,7,8,9,13]

In [67]:
train_set=train_set[columns]

In [70]:
#Assigning col names
train_set.columns= ['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [71]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [73]:
#checking unique number of labels in each column
for feature in train_set.columns[:]:
    print(feature, ':' ,len(train_set[feature].unique()), 'Lables')

Employment : 9 Lables
Degree : 16 Lables
Status : 7 Lables
Designation : 15 Lables
family_job : 6 Lables
Race : 5 Lables
Sex : 2 Lables
Country : 42 Lables

In [76]:
country_map = train_set['Country'].value_counts().to_dict()

In [77]:
#the values in country col will be replaced by its frequency of occurence
#NOTE: do not execute the this statement more than once, otherwise you will get NULL values
train_set['Country'] =train_set['Country'].map(country_map)

C:\Users\Kunal.Sinha1\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [78]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages

1. Not increasing the feature space

#### Disadvantage

1. It will provide the same weight if the frequencies are same for other labels as well

### Target Guided Ordinal Encoding

1. Ordering the labels according to the targets
2. Replace the lables by the joint probability of being 1 or 0

In [80]:
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [81]:
#Replacing the NaN values with Missing
df['Cabin'].fillna('Missing',inplace=True)

In [82]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [85]:
#Replacing the Cabin col values with it's first letter
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [86]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [87]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [91]:
#percentage of survial on cabin/seat
#finding the survial rate
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [92]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [93]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [95]:
#here we are providing the ranks for the labels
#label having highest survial rate, gets highest rank
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [97]:
#mapping it to the cabin col
df['Cabin_ordinal_lables'] = df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_lables
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### Mean Encoding

In [101]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [102]:
df['Mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_lables  Mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

### Probability Ratio Encoding

Steps:-
1. Probability of survived based on Cabin 
2. Probability of Not Survived (1-p(survived))
3. p(survived)/p(Not Survived)
4. Dict to map cabin with probability
5. replace with the categorical feature

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [3]:
df['Cabin'].fillna('Missing',inplace=True)

In [4]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [5]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [6]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [7]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [13]:
prob_df = df.groupby(['Cabin'])['Survived'].mean()

In [14]:
prob_df = pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [15]:
# probability of survial
prob_df['Died'] = 1-prob_df['Survived']

In [17]:
prob_df

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000
F      0.615385  0.384615
G      0.500000  0.500000
M      0.299854  0.700146
T      0.000000  1.000000

In [18]:
prob_df['Probability_ratio'] = prob_df['Survived']/prob_df['Died']

In [19]:
prob_df

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000
F      0.615385  0.384615           1.600000
G      0.500000  0.500000           1.000000
M      0.299854  0.700146           0.428274
T      0.000000  1.000000           0.000000

In [23]:
# converting to dict to replace the ratio with categorical value
probability_encoded = prob_df['Probability_ratio'].to_dict()
probability_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [24]:
df['Cabin_encoded'] = df['Cabin'].map(probability_encoded)
df.head(20)

    Survived Cabin  Cabin_encoded
0          0     M       0.428274
1          1     C       1.458333
2          1     M       0.428274
3          1     C       1.458333
4          0     M       0.428274
5          0     M       0.428274
6          0     E       3.000000
7          0     M       0.428274
8          1     M       0.428274
9          1     M       0.428274
10         1     G       1.000000
11         1     C       1.458333
12         0     M       0.428274
13         0     M       0.428274
14         0     M       0.428274
15         1     M       0.428274
16         0     M       0.428274
17         1     M       0.428274
18         0     M       0.428274
19         1     M       0.428274

In [ ]:
df